name: "resnet50_fe"
platform: "pytorch_libtorch"
max_batch_size : 0
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [ 3, 224, 224 ]
    reshape { shape: [ 1, 3, 224, 224 ] }
  }
]
output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [ 2048 ]
    #reshape { shape: [ 1, 2048, 1, 1 ] }
  }
]
parameters: {
    key: "INFERENCE_MODE"
        value: {
            string_value:"true"
        }
}
